//=============================================================================
//
// ライト処理 [light.h]
// Author : Kodama Yuto
//
//=============================================================================
#ifndef _LIGHT_H_
#define _LIGHT_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_LIGHT (3)

//===================================================================
// クラスの定義
//===================================================================

class CLight
{
public:
	CLight();
	~CLight();


	void Init(void);
	void Uninit(void);
	void Update(void);

private:
	D3DLIGHT9 m_Light[MAX_LIGHT];

	D3DXVECTOR3 m_VecDir[MAX_LIGHT];
	D3DXCOLOR m_DifCol[MAX_LIGHT];

};
#endif // !_LIGHT_H_
