//=============================================================================
//
// ゲーム画面管理クラス処理 [title.cpp]
// Author : Kodama Yuto
//
//=============================================================================
#include "title.h"
#include "Manager.h"
#include "fade.h"

#include "sceneX.h"
#include "scene3D.h"
//==================================================================
// コンストラクタ&デストラクタ
//==================================================================
CTitle::CTitle()
{
}
CTitle::~CTitle()
{

}

//==================================================================
// 初期化処理
//==================================================================
HRESULT CTitle::Init(void)
{

	CSceneX* pX = NULL;
	if (SceneCreate(pX, CScene::PRIORITY_2))
	{
		pX->Set(D3DXVECTOR3(0.0f,0.0f,0.0f),CSceneX::MODEL_AIRPLANE);
	}
	if (SceneCreate(pX, CScene::PRIORITY_2))
	{
		pX->Set(D3DXVECTOR3(50.0f, 0.0f, 50.0f), CSceneX::MODEL_CAR);
	}

	CScene3D* p3D = NULL;
	if (SceneCreate(p3D, CScene::PRIORITY_1))
	{
		p3D->Set(D3DXVECTOR3(0.0f, -20.0f, 0.0f), "WALL");
	}

	return S_OK;
}

//==================================================================
// 終了処理
//==================================================================
void CTitle::Uninit(void)
{
	CScene::ReleaseAll(false);
}

//==================================================================
// 更新処理
//==================================================================
void CTitle::Update(void)
{

}

//==================================================================
// 描画処理
//==================================================================
void CTitle::Draw(void)
{

}

