//=============================================================================
//
// マスク処理 [mask.h]
// Author : 目黒 未来也
//
//=============================================================================
#ifndef _MASK_H_
#define _MASK_H_

#include "main.h"
#include "scene.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//========================================
// クラスの定義
//========================================
//=====================
// オブジェクトクラス
//=====================
class CMask
{
public:
	CMask();	// コンストラクタ
	~CMask();														// デストラクタ

	static CMask *Create();					// オブジェクトの生成

	HRESULT Init(D3DXVECTOR3 pos);		// フェード初期化処理
	void Uninit(void);												// フェード終了処理
	void Update(void);												// フェード更新処理
	void Draw(void);												// フェード描画処理

private:
	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;								// 頂点バッファへのポインタ
};

#endif