//=============================================================================
//
// セレクト処理 [select.cpp]
// Author : 目黒 未来也
//
//=============================================================================
#include "select.h"
#include "debugProc.h"
#include "input.h"
#include "InputKeyboard.h"
#include "manager.h"
#include "fade.h"
#include "time.h"
#include "scene3D.h"
#include "scene2D.h"
#include "sceneX.h"
#include "sceneBillboard.h"

#include "PlayerNumSelect.h"
#include "SelectMenu.h"
//============================================================================
//	マクロ定義
//============================================================================

//============================================================================
//静的メンバ変数宣言
//============================================================================

//=============================================================================
//	コンストラクタ
//=============================================================================
CSelect::CSelect()
{
}

//=============================================================================
//デストラクタ
//=============================================================================
CSelect::~CSelect()
{

}

//=============================================================================
// ポリゴンの初期化処理
//=============================================================================
void CSelect::Init(void)
{
	//CPlayerSelect::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0), 150);
	CSelectMenu::Create(D3DXVECTOR3(SCREEN_WIDTH / 2, SCREEN_HEIGHT / 2, 0), 150, 220, CSelectMenu::MENU_TYPE_TUTORIAL);
}

//=============================================================================
// ポリゴンの終了処理
//=============================================================================
void CSelect::Uninit(void)
{
	//全ての終了処理
	CScene::ReleseAll();
}

//=============================================================================
// ポリゴンの更新処理
//=============================================================================
void CSelect::Update(void)
{
	CManager *pManager = NULL;
	CFade *pFade = pManager->GetFade();

	// 入力情報を取得
	CInputKeyboard *pInputKeyboard;
	pInputKeyboard = CManager::GetInputKeyboard();
	CXInputJoyPad *pXInput = NULL;
	pXInput = CManager::GetXInput();
	//任意のキーENTER
	if (CCommand::GetCommand("ENTER"))
	{
//		pFade->SetFade(pManager->MODE_GAME, pFade->FADE_OUT);
	}


#ifdef _DEBUG
	CDebugProc::Print("c", "セレクト");
#endif
}

//=============================================================================
// ポリゴンの描画処理
//=============================================================================
void CSelect::Draw(void)
{

}
