//=============================================================================
//
// チュートリアルの処理 [tutorial.h]
// Author : 目黒未来也
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "scene.h"

//=============================================================================
// 前方宣言
//=============================================================================

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_TUTORIAL			(3)

class CTutorial
{
public:
	CTutorial();
	~CTutorial();

	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void LoadChara(void);
	static CTutorial *Create(void);

private:
};
#endif